analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32655/Include/gcr_regs.h
/**@} end of group GCR_ECCERR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCCED GCR_ECCCED
 * @brief    ECC Not Double Error Detect Register
 * @{
 */
#define MXC_F_GCR_ECCCED_RAM_POS                       0 /**< ECCCED_RAM Position */
#define MXC_F_GCR_ECCCED_RAM                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM_POS)) /**< ECCCED_RAM Mask */

/**@} end of group GCR_ECCCED_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCIE GCR_ECCIE
 * @brief    ECC IRQ Enable Register
 * @{
 */
#define MXC_F_GCR_ECCIE_RAM_POS                        0 /**< ECCIE_RAM Position */
#define MXC_F_GCR_ECCIE_RAM                            ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM_POS)) /**< ECCIE_RAM Mask */

/**@} end of group GCR_ECCIE_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCADDR GCR_ECCADDR
 * @brief    ECC Error Address Register
 * @{
 */
#define MXC_F_GCR_ECCADDR_ECCERRAD_POS                 0 /**< ECCADDR_ECCERRAD Position */
#define MXC_F_GCR_ECCADDR_ECCERRAD                     ((uint32_t)(0xFFFFFFFFUL << MXC_F_GCR_ECCADDR_ECCERRAD_POS)) /**< ECCADDR_ECCERRAD Mask */

/**@} end of group GCR_ECCADDR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_BTLELDOCTRL GCR_BTLELDOCTRL
 * @brief    BTLE LDO Control Register
 * @{
 */
#define MXC_F_GCR_BTLELDOCTRL_LDORXEN_POS              0 /**< BTLELDOCTRL_LDORXEN Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORXEN                  ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORXEN_POS)) /**< BTLELDOCTRL_LDORXEN Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORXPULLD_POS           1 /**< BTLELDOCTRL_LDORXPULLD Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORXPULLD               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORXPULLD_POS)) /**< BTLELDOCTRL_LDORXPULLD Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORXVSEL_POS            2 /**< BTLELDOCTRL_LDORXVSEL Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORXVSEL                ((uint32_t)(0x3UL << MXC_F_GCR_BTLELDOCTRL_LDORXVSEL_POS)) /**< BTLELDOCTRL_LDORXVSEL Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOTXEN_POS              4 /**< BTLELDOCTRL_LDOTXEN Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOTXEN                  ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOTXEN_POS)) /**< BTLELDOCTRL_LDOTXEN Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOTXPULLD_POS           5 /**< BTLELDOCTRL_LDOTXPULLD Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOTXPULLD               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOTXPULLD_POS)) /**< BTLELDOCTRL_LDOTXPULLD Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOTXVSEL_POS            6 /**< BTLELDOCTRL_LDOTXVSEL Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOTXVSEL                ((uint32_t)(0x3UL << MXC_F_GCR_BTLELDOCTRL_LDOTXVSEL_POS)) /**< BTLELDOCTRL_LDOTXVSEL Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOTXBYP_POS             8 /**< BTLELDOCTRL_LDOTXBYP Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOTXBYP                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOTXBYP_POS)) /**< BTLELDOCTRL_LDOTXBYP Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOTXDISCH_POS           9 /**< BTLELDOCTRL_LDOTXDISCH Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOTXDISCH               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOTXDISCH_POS)) /**< BTLELDOCTRL_LDOTXDISCH Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORXBYP_POS             10 /**< BTLELDOCTRL_LDORXBYP Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORXBYP                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORXBYP_POS)) /**< BTLELDOCTRL_LDORXBYP Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORXDISCH_POS           11 /**< BTLELDOCTRL_LDORXDISCH Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORXDISCH               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORXDISCH_POS)) /**< BTLELDOCTRL_LDORXDISCH Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORXENDLY_POS           12 /**< BTLELDOCTRL_LDORXENDLY Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORXENDLY               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORXENDLY_POS)) /**< BTLELDOCTRL_LDORXENDLY Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOTXENDLY_POS           13 /**< BTLELDOCTRL_LDOTXENDLY Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOTXENDLY               ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOTXENDLY_POS)) /**< BTLELDOCTRL_LDOTXENDLY Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDOTXBYPENENDLY_POS      14 /**< BTLELDOCTRL_LDOTXBYPENENDLY Position */
#define MXC_F_GCR_BTLELDOCTRL_LDOTXBYPENENDLY          ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDOTXBYPENENDLY_POS)) /**< BTLELDOCTRL_LDOTXBYPENENDLY Mask */

#define MXC_F_GCR_BTLELDOCTRL_LDORXBYPENENDLY_POS      15 /**< BTLELDOCTRL_LDORXBYPENENDLY Position */
#define MXC_F_GCR_BTLELDOCTRL_LDORXBYPENENDLY          ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_LDORXBYPENENDLY_POS)) /**< BTLELDOCTRL_LDORXBYPENENDLY Mask */

/**@} end of group GCR_BTLELDOCTRL_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_BTLELDODLY GCR_BTLELDODLY
 * @brief    BTLE LDO Delay Register
 * @{
 */
#define MXC_F_GCR_BTLELDODLY_BYPDLYCNT_POS             0 /**< BTLELDODLY_BYPDLYCNT Position */
#define MXC_F_GCR_BTLELDODLY_BYPDLYCNT                 ((uint32_t)(0xFFUL << MXC_F_GCR_BTLELDODLY_BYPDLYCNT_POS)) /**< BTLELDODLY_BYPDLYCNT Mask */

#define MXC_F_GCR_BTLELDODLY_LDORXDLYCNT_POS           8 /**< BTLELDODLY_LDORXDLYCNT Position */
#define MXC_F_GCR_BTLELDODLY_LDORXDLYCNT               ((uint32_t)(0x1FFUL << MXC_F_GCR_BTLELDODLY_LDORXDLYCNT_POS)) /**< BTLELDODLY_LDORXDLYCNT Mask */

#define MXC_F_GCR_BTLELDODLY_LDOTXDLYCNT_POS           20 /**< BTLELDODLY_LDOTXDLYCNT Position */
#define MXC_F_GCR_BTLELDODLY_LDOTXDLYCNT               ((uint32_t)(0x1FFUL << MXC_F_GCR_BTLELDODLY_LDOTXDLYCNT_POS)) /**< BTLELDODLY_LDOTXDLYCNT Mask */

/**@} end of group GCR_BTLELDODLY_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32655_INCLUDE_GCR_REGS_H_
